CHaerem/Glance/esp32-client/src/main.cpp
    // Power down display
    EPD_13IN3E_Sleep();

    // Check for commands again before sleeping
    bool shouldStayAwake = checkForCommands();

    if (shouldStayAwake)
    {
        reportDeviceStatus("staying_awake", batteryVoltage, signalStrength);
        sendLogToServer("Staying awake for remote commands");
        
        // Enable serial streaming while awake
        enableSerialStreaming();
        
        // Stay awake for up to 5 minutes, checking for commands every 30 seconds
        unsigned long stayAwakeStart = millis();
        unsigned long stayAwakeTimeout = 5 * 60 * 1000; // 5 minutes
        
        while (millis() - stayAwakeStart < stayAwakeTimeout)
        {
            // Send heartbeat to maintain connection
            sendHeartbeat();
            
            // Wait between heartbeats, but check for commands more frequently
            unsigned long heartbeatStart = millis();
            while (millis() - heartbeatStart < HEARTBEAT_INTERVAL && 
                   millis() - stayAwakeStart < stayAwakeTimeout)
            {
                delay(CONNECTION_CHECK_INTERVAL); // Check every 5 seconds
                esp_task_wdt_reset(); // Reset watchdog during stay awake period
                
                // Check for new commands
                if (checkForCommands())
                {
                    // New commands received, continue staying awake
                    stayAwakeStart = millis(); // Reset stay awake timer
                }
            }
            
            // If we haven't received commands for a while, check server reachability
            if (!isServerReachable())
            {
                Debug("Server unreachable, ending stay awake period\r\n");
                sendLogToServer("Ending stay awake - server unreachable", "WARN");
                break;
            }
        }
        
        // Disable serial streaming before sleeping
        disableSerialStreaming();
    }

    // Report going to sleep
    reportDeviceStatus("sleeping", batteryVoltage, signalStrength);
    String sleepMessage = "Entering deep sleep for " + String(lastSleepDuration / 1000000) + " seconds";
    sendLogToServer(sleepMessage.c_str());

    // Enter deep sleep
    enterDeepSleep(lastSleepDuration);
}

void loop()
{
    // This should never be reached due to deep sleep
    delay(1000);
}

void setupPowerManagement()
{
    Debug("Setting up power management...\r\n");

    // Set CPU frequency to 80MHz for power efficiency
    setCpuFrequencyMhz(80);
    Debug("CPU frequency set to 80MHz\r\n");

    // Disable brownout detector for battery operation
    WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
    Debug("Brownout detector disabled\r\n");

    // Configure watchdog timer (300 seconds = 5 minutes)
    esp_task_wdt_init(300, true);
    esp_task_wdt_add(NULL);
    Debug("Watchdog timer configured (300s)\r\n");

    // Configure wake-up source
    esp_sleep_enable_timer_wakeup(DEFAULT_SLEEP_TIME);
}

bool connectToWiFi()
{
    Debug("Connecting to WiFi: " WIFI_SSID "\r\n");

    // Try WiFi connection with multiple attempts
    for (int retry = 0; retry < 3; retry++)
    {
        WiFi.mode(WIFI_STA);
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 20)
        {
            delay(500);
            Debug(".");
            attempts++;
            
            // Feed watchdog during long operations
            esp_task_wdt_reset();
        }

        if (WiFi.status() == WL_CONNECTED)
        {
            Debug("\r\nWiFi connected!\r\n");
            Debug("IP address: " + WiFi.localIP().toString() + "\r\n");
            Debug("Signal strength: " + String(WiFi.RSSI()) + " dBm\r\n");
            return true;
        }
        
        Debug("\r\nWiFi connection attempt " + String(retry + 1) + " failed\r\n");
        
        if (retry < 2)
        {
            WiFi.disconnect();
            delay(2000); // Wait before retry
        }
    }
    
    Debug("WiFi connection failed after 3 attempts!\r\n");
    return false;
}

bool fetchCurrentImage()
{
    Debug("Fetching current image from server...\r\n");

    HTTPClient http;
    http.begin(API_BASE_URL "current.json");
    http.setTimeout(60000); // 60 second timeout for large image downloads
    http.setConnectTimeout(10000); // 10 second connection timeout
    http.addHeader("User-Agent", "ESP32-Glance-Client/" FIRMWARE_VERSION);
    http.addHeader("Connection", "close"); // Force connection close after request

    Debug("Sending HTTP GET request...\r\n");
    int httpResponseCode = http.GET();
    Debug("HTTP response code: " + String(httpResponseCode) + "\r\n");

    if (httpResponseCode == 200)
    {
        Debug("Getting response payload...\r\n");
        Debug("Free heap before parsing: " + String(ESP.getFreeHeap()) + "\r\n");
        
        // Get response size first
        int contentLength = http.getSize();
        Debug("Content-Length header: " + String(contentLength) + "\r\n");
        
        // Use streaming JSON parsing for large responses
        bool success = parseStreamingJSON(http);
        
        http.end();
        return success;
    }
    else
    {
        Debug("HTTP Error: " + String(httpResponseCode) + "\r\n");
    }

    http.end();
    return false;
}

void displayImageFromData(const uint8_t *imageData, int width, int height)
{
    Debug("Displaying image: " + String(width) + "x" + String(height) + "\r\n");
    Debug("Free heap before display: " + String(ESP.getFreeHeap()) + "\r\n");

    // For debugging, show first few bytes of image data
    Debug("First 10 image bytes: ");
    for (int i = 0; i < min(10, width * height); i++) {
        Debug(String(imageData[i], HEX) + " ");
    }
    Debug("\r\n");

