CHaerem/Glance/esp32-client/src/main.cpp
bool isServerReachable()
{
    return commState.serverReachable || 
           (millis() - commState.lastSuccessfulContact < 300000); // 5 minutes grace period
}

void adaptiveDelay(int baseDelay)
{
    // Use shorter delays if we have good connectivity, longer if poor
    int actualDelay = baseDelay;
    if (commState.consecutiveFailures > 2)
    {
        actualDelay *= 2; // Double delay if having connection issues
    }
    
    unsigned long startTime = millis();
    while (millis() - startTime < actualDelay)
    {
        esp_task_wdt_reset(); // Feed watchdog during delays
        delay(100);
    }
}

// Serial streaming functions for efficient real-time monitoring

void enableSerialStreaming()
{
    if (!serialStream.streamingEnabled && isServerReachable())
    {
        serialStream.streamingEnabled = true;
        serialStream.buffer.reserve(SERIAL_STREAM_BUFFER_SIZE);
        serialStream.lastStreamTime = millis();
        Debug("Serial streaming enabled\r\n");
        
        // Send initial stream enable notification
        DynamicJsonDocument doc(512);
        doc["deviceId"] = DEVICE_ID;
        doc["streamEvent"] = "started";
        doc["timestamp"] = millis();
        
        String jsonString;
        serializeJson(doc, jsonString);
        bufferMessage("serial-stream", jsonString);
    }
}

void disableSerialStreaming()
{
    if (serialStream.streamingEnabled)
    {
        // Flush any remaining buffer content
        if (serialStream.buffer.length() > 0)
        {
            flushSerialStream();
        }
        
        serialStream.streamingEnabled = false;
        serialStream.isStreaming = false;
        serialStream.buffer = "";
        Debug("Serial streaming disabled\r\n");
        
        // Send stream disable notification
        DynamicJsonDocument doc(512);
        doc["deviceId"] = DEVICE_ID;
        doc["streamEvent"] = "stopped";
        doc["timestamp"] = millis();
        
        String jsonString;
        serializeJson(doc, jsonString);
        bufferMessage("serial-stream", jsonString);
    }
}

void captureSerialOutput(const String &output)
{
    if (!serialStream.streamingEnabled) return;
    
    // Add to buffer
    serialStream.buffer += output;
    
    // If buffer is getting full or enough time has passed, flush it
    if (serialStream.buffer.length() >= SERIAL_STREAM_MIN_CHARS ||
        (serialStream.buffer.length() > 0 && 
         millis() - serialStream.lastStreamTime >= SERIAL_STREAM_INTERVAL))
    {
        flushSerialStream();
    }
}

void flushSerialStream()
{
    if (!serialStream.streamingEnabled || serialStream.buffer.length() == 0) return;
    
    DynamicJsonDocument doc(2048);
    doc["deviceId"] = DEVICE_ID;
    doc["serialOutput"] = serialStream.buffer;
    doc["timestamp"] = millis();
    doc["bufferSize"] = serialStream.buffer.length();
    
    String jsonString;
    serializeJson(doc, jsonString);
    
    String response;
    String streamUrl = String(API_BASE_URL) + "serial-stream";
    
    if (makeHttpRequest(streamUrl, "POST", jsonString, response, BASE_TIMEOUT))
    {
        // Successfully streamed, clear buffer
        serialStream.buffer = "";
        serialStream.lastStreamTime = millis();
    }
    else
    {
        // Failed to stream, keep buffer but prevent it from growing too large
        if (serialStream.buffer.length() > SERIAL_STREAM_BUFFER_SIZE)
        {
            // Keep only the last half of the buffer to prevent memory issues
            int keepLength = SERIAL_STREAM_BUFFER_SIZE / 2;
            serialStream.buffer = serialStream.buffer.substring(serialStream.buffer.length() - keepLength);
        }
    }
}

// Custom debug write function that captures output for streaming
size_t debugWrite(const uint8_t *buffer, size_t size)
{
    // Write to serial as normal
    size_t written = Serial.write(buffer, size);
    
    // If streaming is enabled and we have good connectivity, capture the output
    if (serialStream.streamingEnabled && isServerReachable())
    {
        String output = "";
        for (size_t i = 0; i < size; i++)
        {
            output += (char)buffer[i];
        }
        captureSerialOutput(output);
    }
    
    return written;
}

// Streaming JSON parser for large responses - extracts fields without loading entire JSON
bool parseStreamingJSON(HTTPClient &http) {
    Debug("Starting streaming JSON parse...\r\n");
    
    String title = "";
    String imageBase64 = "";
    uint64_t sleepDuration = DEFAULT_SLEEP_TIME;
    
    const int CHUNK_SIZE = 4096; // Process 4KB chunks
    char buffer[CHUNK_SIZE + 1];
    String jsonAccumulator = "";
    int totalBytesRead = 0;
    bool foundTitle = false, foundSleep = false, foundImageStart = false;
    bool imageComplete = false;
    
    WiFiClient* stream = http.getStreamPtr();
    
    while (http.connected() && !imageComplete) {
        esp_task_wdt_reset(); // Feed watchdog during long operation
        
        // Read next chunk
        int bytesRead = stream->readBytes(buffer, CHUNK_SIZE);
        if (bytesRead <= 0) break;
        
        buffer[bytesRead] = '\0';
        totalBytesRead += bytesRead;
        jsonAccumulator += String(buffer);
        
        Debug("Read " + String(bytesRead) + " bytes (total: " + String(totalBytesRead) + ")\r\n");
        Debug("Free heap: " + String(ESP.getFreeHeap()) + "\r\n");
        
        // Extract fields as we find them
        if (!foundTitle) {
            int pos = 0;
            title = extractJSONField(jsonAccumulator, "title", pos);
            if (title.length() > 0) {
                foundTitle = true;
                Debug("Found title: " + title + "\r\n");
            }
        }
        
        if (!foundSleep) {
            int pos = 0;
            String sleepStr = extractJSONField(jsonAccumulator, "sleepDuration", pos);
            if (sleepStr.length() > 0) {
                sleepDuration = sleepStr.toInt();
                foundSleep = true;
                Debug("Found sleep duration: " + String(sleepDuration / 1000000) + " seconds\r\n");
            }
        }
        
        // For image data, we need to be more careful due to size
        if (!foundImageStart) {
            int imageStartPos = jsonAccumulator.indexOf("\"image\":\"");
            if (imageStartPos >= 0) {
                foundImageStart = true;
                Debug("Found image data start\r\n");
                
                // Find where the base64 data actually starts
                int dataStart = imageStartPos + 9; // Length of '"image":"'
                
