CHaerem/Glance/esp32-client/src/main.cpp
            // Remove the processed base64 data (approximately 4800 chars for 3600 bytes)
            if (smallBase64Buffer.length() > 4800) {
                smallBase64Buffer = smallBase64Buffer.substring(4800);
            } else {
                smallBase64Buffer = "";
            }
        } else {
            Debug("Row " + String(row) + " decode failed: " + String(decoded) + " bytes\r\n");
            // Remove some data to advance
            if (smallBase64Buffer.length() > 1000) {
                smallBase64Buffer = smallBase64Buffer.substring(800);
            }
        }
        
        // Progress indicator
        if (row % 50 == 0) {
            Debug("Row " + String(row) + ": " + String(decoded) + " bytes decoded\r\n");
            Debug("Free heap: " + String(ESP.getFreeHeap()) + "\r\n");
        }
        
        // Safety check - if we've processed some rows successfully, that's good progress
        if (rowsProcessed >= 10 && !http.connected()) {
            Debug("Connection lost but made progress: " + String(rowsProcessed) + " rows\r\n");
            break;
        }
    }
    
    Debug("Image processing complete: " + String(rowsProcessed) + " rows processed\r\n");
    
    free(rgbBuffer);
    free(einkRowBuffer);
    
    Debug("Streaming image processing completed\r\n");
    Debug("Total image bytes processed: " + String(totalImageBytes) + "\r\n");
    
    return totalImageBytes > 0;
}

// Decode base64 directly into a buffer without creating String objects
int decodeBase64ToBuffer(const String &base64, uint8_t* buffer, int maxSize) {
    const char *chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
    int outputPos = 0;
    
    for (int i = 0; i < base64.length() && outputPos + 3 < maxSize; i += 4) {
        unsigned long combined = 0;
        int validChars = 0;
        
        // Process 4 characters
        for (int j = 0; j < 4 && (i + j) < base64.length(); j++) {
            char c = base64.charAt(i + j);
            if (c == '=') break;
            
            int val = 0;
            if (c >= 'A' && c <= 'Z') {
                val = c - 'A';
            } else if (c >= 'a' && c <= 'z') {
                val = c - 'a' + 26;
            } else if (c >= '0' && c <= '9') {
                val = c - '0' + 52;
            } else if (c == '+') {
                val = 62;
            } else if (c == '/') {
                val = 63;
            }
            
            combined = (combined << 6) | val;
            validChars++;
        }
        
        // Extract bytes
        if (validChars >= 2 && outputPos < maxSize) {
            buffer[outputPos++] = (combined >> 16) & 0xFF;
        }
        if (validChars >= 3 && outputPos < maxSize) {
            buffer[outputPos++] = (combined >> 8) & 0xFF;
        }
        if (validChars >= 4 && outputPos < maxSize) {
            buffer[outputPos++] = combined & 0xFF;
        }
    }
    
    return outputPos;
}

// Stream full image directly from server using PSRAM - your friend's brilliant approach!
bool streamImageToPSRAM() {
    Debug("=== STREAMING IMAGE TO PSRAM (new approach) ===\r\n");
    Debug("Regular heap: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    Debug("PSRAM free: " + String(heap_caps_get_free_size(MALLOC_CAP_SPIRAM)) + " bytes\r\n");
    
    const int IMAGE_WIDTH = 1200;
    const int IMAGE_HEIGHT = 1600;
    const int BUFFER_SIZE = (IMAGE_WIDTH * IMAGE_HEIGHT) / 2; // 960KB for 4-bit packed
    
    // Step 1: Allocate image buffer in PSRAM
    uint8_t* imageBuffer = (uint8_t*)heap_caps_malloc(BUFFER_SIZE, MALLOC_CAP_SPIRAM);
    if (imageBuffer == nullptr) {
        Debug("ERROR: Cannot allocate 960KB in PSRAM\r\n");
        return false;
    }
    
    Debug("SUCCESS: Allocated 960KB image buffer in PSRAM\r\n");
    Debug("PSRAM after allocation: " + String(heap_caps_get_free_size(MALLOC_CAP_SPIRAM)) + " bytes\r\n");
    
    // Step 2: Stream raw image data directly from server
    HTTPClient http;
    http.setTimeout(60000); // 60 second timeout for large images
    
    // Request raw binary image data (no JSON, no base64!)
    String imageUrl = "http://serverpi.local:3000/api/image.bin";
    Debug("Fetching raw image: " + imageUrl + "\r\n");
    
    http.begin(imageUrl);
    int httpCode = http.GET();
    
    if (httpCode != HTTP_CODE_OK) {
        Debug("ERROR: HTTP request failed: " + String(httpCode) + "\r\n");
        heap_caps_free(imageBuffer);
        http.end();
        return false;
    }
    
    int contentLength = http.getSize();
    Debug("Content-Length: " + String(contentLength) + " bytes\r\n");
    
    if (contentLength != BUFFER_SIZE) {
        Debug("WARNING: Expected " + String(BUFFER_SIZE) + " bytes, got " + String(contentLength) + "\r\n");
    }
    
    // Step 3: Stream data directly into PSRAM buffer
    WiFiClient* stream = http.getStreamPtr();
    int totalBytesRead = 0;
    int bufferOffset = 0;
    
    Debug("Starting direct stream to PSRAM...\r\n");
    
    while (http.connected() && totalBytesRead < BUFFER_SIZE) {
        size_t availableBytes = stream->available();
        if (availableBytes > 0) {
            // Read in chunks, directly into PSRAM
            int chunkSize = min((int)availableBytes, min(4096, BUFFER_SIZE - totalBytesRead));
            int bytesRead = stream->readBytes(imageBuffer + bufferOffset, chunkSize);
            
            totalBytesRead += bytesRead;
            bufferOffset += bytesRead;
            
            if (totalBytesRead % 50000 == 0) { // Every 50KB
                Debug("Streamed " + String(totalBytesRead/1024) + "KB / " + String(BUFFER_SIZE/1024) + "KB\r\n");
            }
        } else {
            delay(10); // Small delay if no data available
        }
    }
    
    Debug("Stream complete: " + String(totalBytesRead) + " bytes received\r\n");
    
    // Step 4: Clean up HTTP resources to free regular heap
    http.end();
    Debug("HTTP connection closed\r\n");
    Debug("Regular heap after cleanup: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
    // Step 5: Display image with single refresh (like original Bhutan flag!)
    if (totalBytesRead >= BUFFER_SIZE * 0.9) { // Allow for some size variance
        Debug("Image stream successful - displaying with SINGLE refresh...\r\n");
        EPD_13IN3E_Display(imageBuffer);
        Debug("PERFECT: Single refresh complete! Full WiFi image displayed like original flag.\r\n");
    } else {
        Debug("ERROR: Incomplete image received, not displaying\r\n");
    }
    
    // Step 6: Free PSRAM buffer
    heap_caps_free(imageBuffer);
    Debug("PSRAM buffer freed\r\n");
    Debug("Final PSRAM free: " + String(heap_caps_get_free_size(MALLOC_CAP_SPIRAM)) + " bytes\r\n");
    
    return totalBytesRead >= BUFFER_SIZE * 0.9;
}

// Override the current approach - use PSRAM streaming instead
void displayRowData(const uint8_t* rowData, int row, int width) {    
    static bool imageStreamed = false;
    
    if (!imageStreamed) {
        Debug("Switching to PSRAM streaming approach...\r\n");
        bool success = streamImageToPSRAM();
        if (success) {
            Debug("PSRAM streaming successful!\r\n");
        } else {
            Debug("PSRAM streaming failed - will try fallback\r\n");
        }
        imageStreamed = true;
    }
}